{"deep": 2622, "learning": 5328, "with": 10209, "python": 7490, "hands": 4309, "on": 6562, "introduction": 5011, "to": 9476, "using": 9898, "keras": 5183, "and": 576, "tensorflow": 9060, "neural": 6271, "networks": 6258, "ai": 419, "deep learning": 2624, "learning with": 5392, "with python": 10265, "python hands": 7496, "hands on": 4310, "on introduction": 6593, "introduction to": 5013, "to deep": 9501, "learning using": 5390, "using keras": 9916, "keras and": 5184, "and tensorflow": 891, "tensorflow deep": 9063, "learning neural": 5367, "neural networks": 6276, "networks keras": 6264, "keras tensorflow": 5185, "tensorflow ai": 9061, "clean": 1830, "code": 1886, "handbook": 4303, "of": 6383, "agile": 402, "software": 8406, "craftsmanship": 2412, "principles": 7209, "best": 1438, "practices": 7148, "for": 3703, "writing": 10366, "maintainable": 5566, "refactoring": 7676, "clean code": 1831, "code handbook": 1893, "handbook of": 4306, "of agile": 6386, "agile software": 410, "software craftsmanship": 8429, "craftsmanship principles": 2413, "principles and": 7210, "and best": 606, "best practices": 1440, "practices for": 7153, "for writing": 3886, "writing clean": 10368, "clean maintainable": 1832, "maintainable code": 5567, "code clean": 1889, "code refactoring": 1898, "refactoring best": 7677, "practices agile": 7149, "designing": 2732, "data": 2520, "intensive": 4926, "applications": 998, "patterns": 6865, "systems": 8919, "scalability": 8014, "consistency": 2291, "reliability": 7718, "database": 2556, "distributed": 2929, "designing data": 2735, "data intensive": 2534, "intensive applications": 4927, "applications patterns": 1008, "patterns for": 6868, "for data": 3742, "data systems": 2550, "systems scalability": 8957, "scalability consistency": 8015, "consistency reliability": 2292, "reliability data": 7721, "systems database": 8933, "database distributed": 2559, "distributed scalability": 2939, "algorithms": 468, "comprehensive": 2086, "textbook": 9106, "covering": 2397, "broad": 1552, "range": 7575, "structures": 8764, "complexity": 2062, "to algorithms": 9479, "algorithms comprehensive": 472, "comprehensive textbook": 2090, "textbook covering": 9107, "covering broad": 2398, "broad range": 1554, "range of": 7576, "of algorithms": 6388, "algorithms algorithms": 469, "algorithms data": 474, "data structures": 2549, "structures complexity": 8768, "the": 9116, "pragmatic": 7162, "programmer": 7364, "your": 10400, "journey": 5148, "mastery": 5679, "modern": 6025, "edition": 3075, "classic": 1808, "guidance": 4253, "development": 2786, "productivity": 7331, "tips": 9474, "the pragmatic": 9288, "pragmatic programmer": 7163, "programmer your": 7369, "your journey": 10404, "journey to": 5149, "to mastery": 9540, "mastery modern": 5681, "modern edition": 6031, "edition of": 3077, "of classic": 6404, "classic guidance": 1809, "guidance for": 4254, "for pragmatic": 3834, "pragmatic software": 7164, "software development": 8433, "development practices": 2798, "practices craftsmanship": 7151, "craftsmanship productivity": 2414, "productivity tips": 7333, "cookbook": 2345, "recipes": 7643, "programmers": 7370, "wide": 10173, "topics": 9622, "python cookbook": 7493, "cookbook recipes": 2346, "recipes for": 7644, "for python": 3840, "python programmers": 7504, "programmers covering": 7371, "covering wide": 2399, "wide range": 10174, "of topics": 6538, "topics python": 9626, "python recipes": 7506, "recipes tips": 7646, "tips patterns": 9475, "natural": 6180, "language": 5268, "processing": 7295, "transformers": 9681, "practical": 7115, "guide": 4257, "building": 1580, "nlp": 6308, "transformer": 9679, "models": 6016, "huggingface": 4448, "bert": 1436, "gpt": 4195, "natural language": 6182, "language processing": 5273, "processing with": 7306, "with transformers": 10287, "transformers practical": 9684, "practical guide": 7123, "guide to": 4264, "to building": 9491, "building nlp": 1594, "nlp systems": 6309, "systems with": 8969, "with transformer": 10286, "transformer models": 9680, "models nlp": 6021, "nlp transformers": 6310, "transformers huggingface": 9683, "huggingface bert": 4449, "bert gpt": 1437, "machine": 5539, "scikit": 8095, "learn": 5319, "end": 3196, "ml": 5938, "examples": 3481, "libraries": 5427, "on machine": 6599, "machine learning": 5542, "with scikit": 10269, "scikit learn": 8097, "learn keras": 5322, "tensorflow end": 9064, "end to": 3199, "to end": 9510, "end ml": 3197, "ml with": 5944, "with practical": 10263, "practical examples": 7122, "examples and": 3482, "and modern": 778, "modern libraries": 6033, "libraries machine": 5429, "learning scikit": 5381, "system": 8886, "concepts": 2234, "foundational": 3922, "architectures": 1120, "sql": 8627, "transactions": 9665, "indexing": 4750, "concurrency": 2252, "database system": 2565, "system concepts": 8893, "concepts foundational": 2240, "foundational principles": 3926, "principles of": 7212, "of database": 6424, "database systems": 2566, "systems and": 8923, "and architectures": 594, "architectures sql": 1127, "sql transactions": 8633, "transactions indexing": 9666, "indexing concurrency": 4752, "site": 8327, "engineering": 3222, "how": 4431, "google": 4185, "runs": 7961, "production": 7326, "sre": 8634, "reliable": 7725, "scalable": 8017, "services": 8243, "devops": 2816, "monitoring": 6061, "incident": 4743, "response": 7799, "site reliability": 8329, "reliability engineering": 7722, "engineering how": 3250, "how google": 4434, "google runs": 4188, "runs production": 7962, "production systems": 7330, "systems principles": 8950, "and practices": 815, "practices of": 7155, "of sre": 6527, "sre for": 8636, "for reliable": 3845, "reliable scalable": 7729, "scalable services": 8024, "services sre": 8253, "sre devops": 8635, "devops reliability": 2821, "reliability monitoring": 7723, "monitoring incident": 6062, "incident response": 4744, "microservices": 5867, "evolving": 3464, "operating": 6671, "architecture": 1086, "building microservices": 1593, "microservices guidance": 5869, "guidance on": 4255, "on designing": 6577, "designing evolving": 2736, "evolving and": 3465, "and operating": 798, "operating microservices": 6673, "microservices microservices": 5870, "microservices architecture": 5868, "architecture distributed": 1096, "distributed systems": 2941, "accelerate": 258, "science": 8054, "research": 7768, "backed": 1326, "metrics": 5840, "that": 9113, "drive": 3005, "high": 4382, "performance": 6911, "dora": 2989, "delivery": 2643, "accelerate the": 259, "the science": 9310, "science of": 8067, "of devops": 6426, "devops research": 2822, "research backed": 7771, "backed metrics": 1327, "metrics and": 5841, "practices that": 7157, "that drive": 9114, "drive high": 3006, "high performance": 4384, "performance dora": 6916, "dora metrics": 2990, "metrics devops": 5842, "devops delivery": 2819, "delivery performance": 2644, "art": 1151, "computer": 2134, "programming": 7373, "vol": 10061, "text": 9100, "fundamental": 4005, "analysis": 541, "the art": 9136, "art of": 1155, "of computer": 6413, "computer programming": 2170, "programming vol": 7410, "vol classic": 10066, "classic text": 1811, "text on": 9101, "on fundamental": 6586, "fundamental algorithms": 4006, "algorithms and": 471, "and analysis": 588, "analysis algorithms": 542, "algorithms analysis": 470, "analysis fundamental": 547, "reinforcement": 7704, "an": 518, "methods": 5828, "in": 4616, "rl": 7892, "agents": 392, "markov": 5655, "decision": 2605, "process": 7261, "reinforcement learning": 7705, "learning an": 5334, "an introduction": 530, "introduction foundational": 5012, "foundational concepts": 3924, "concepts and": 2236, "and methods": 765, "methods in": 5833, "in reinforcement": 4712, "learning reinforcement": 5376, "learning rl": 5379, "rl agents": 7893, "agents markov": 398, "markov decision": 5656, "decision process": 2609, "pattern": 6856, "recognition": 7649, "probabilistic": 7230, "perspective": 6938, "bayesian": 1383, "probability": 7237, "pattern recognition": 6863, "recognition and": 7650, "and machine": 748, "learning probabilistic": 5371, "probabilistic perspective": 7234, "perspective on": 6940, "on pattern": 6606, "and ml": 772, "ml bayesian": 5939, "bayesian probability": 1388, "probability pattern": 7240, "information": 4785, "retrieval": 7824, "search": 8117, "engines": 3311, "ir": 5048, "including": 4745, "ranking": 7580, "tf": 9111, "idf": 4511, "to information": 9525, "information retrieval": 4797, "retrieval textbook": 7825, "textbook on": 9108, "on search": 6613, "search engines": 8119, "engines and": 3312, "and ir": 732, "ir including": 5049, "including indexing": 4748, "indexing and": 4751, "and ranking": 834, "ranking information": 7581, "retrieval tf": 7826, "tf idf": 9112, "idf search": 4512, "search ranking": 8121, "statistics": 8695, "scientists": 8091, "essential": 3387, "statistical": 8682, "practice": 7137, "inference": 4768, "regression": 7696, "sampling": 7984, "practical statistics": 7133, "statistics for": 8698, "data scientists": 2545, "scientists essential": 8093, "essential statistical": 3392, "statistical methods": 8688, "methods for": 5831, "data science": 2543, "science practice": 8068, "practice statistics": 7146, "statistics inference": 8700, "inference regression": 4771, "regression sampling": 7698, "effective": 3092, "java": 5105, "idioms": 4513, "robust": 7910, "design": 2691, "effective java": 3095, "java best": 5108, "practices and": 7150, "and idioms": 715, "idioms for": 4516, "writing robust": 10370, "robust java": 7912, "java code": 5110, "code java": 1895, "practices design": 7152, "design patterns": 2713, "fundamentals": 4009, "coverage": 2395, "theory": 9382, "relational": 7709, "normalization": 6328, "fundamentals of": 4012, "systems comprehensive": 8929, "comprehensive coverage": 2087, "coverage of": 2396, "database theory": 2567, "theory and": 9383, "and practice": 814, "practice database": 7138, "database relational": 2563, "relational design": 7710, "design normalization": 2710, "core": 2360, "case": 1666, "studies": 8791, "memory": 5790, "processes": 7289, "operating system": 6674, "concepts core": 2238, "core concepts": 2362, "concepts of": 2241, "of modern": 6482, "modern operating": 6035, "operating systems": 6675, "with case": 10221, "case studies": 1670, "studies operating": 8793, "systems concurrency": 8932, "concurrency memory": 2255, "memory processes": 5795, "artificial": 1162, "intelligence": 4889, "approach": 1041, "overview": 6781, "techniques": 9017, "planning": 7012, "reasoning": 7633, "artificial intelligence": 1165, "intelligence modern": 4901, "modern approach": 6026, "approach comprehensive": 1042, "comprehensive overview": 2089, "overview of": 6782, "of ai": 6387, "ai concepts": 422, "and techniques": 886, "techniques ai": 9018, "ai search": 426, "search planning": 8120, "planning reasoning": 7013, "elements": 3145, "reference": 7683, "classification": 1817, "the elements": 9189, "elements of": 3146, "of statistical": 6528, "statistical learning": 8686, "learning classic": 5343, "classic reference": 1810, "reference on": 7687, "on statistical": 6616, "learning theory": 5386, "methods statistical": 5836, "learning regression": 5375, "regression classification": 7697, "graphical": 4204, "book": 1512, "pgms": 6960, "pgm": 6958, "probabilistic graphical": 7233, "graphical models": 4205, "models principles": 6023, "techniques foundational": 9022, "foundational book": 3923, "book on": 1518, "on pgms": 6608, "pgms including": 6961, "including bayesian": 4746, "bayesian and": 1385, "and markov": 756, "markov networks": 5657, "networks pgm": 6266, "pgm bayesian": 6959, "bayesian networks": 1387, "networks inference": 6263, "inference probability": 4770, "grokking": 4238, "illustrated": 4547, "beginners": 1407, "visualization": 10043, "basics": 1377, "grokking algorithms": 4239, "algorithms illustrated": 476, "illustrated guide": 4548, "to fundamental": 9517, "algorithms for": 475, "for beginners": 3722, "beginners algorithms": 1408, "algorithms visualization": 485, "visualization basics": 10045, "fluent": 3692, "dive": 2949, "into": 4999, "pythonic": 7510, "features": 3622, "asyncio": 1219, "typing": 9749, "fluent python": 3693, "python deep": 7494, "deep dive": 2623, "dive into": 2950, "into pythonic": 5003, "pythonic idioms": 7511, "idioms and": 4514, "modern features": 6032, "features python": 3623, "python idioms": 7498, "idioms asyncio": 4515, "asyncio typing": 1220, "networking": 6246, "top": 9619, "down": 2993, "introductory": 5014, "application": 982, "first": 3668, "tcp": 8990, "ip": 5039, "internet": 4977, "computer networking": 2164, "networking top": 6256, "top down": 9620, "down approach": 2994, "approach introductory": 1044, "introductory networking": 5017, "networking text": 6255, "text using": 9104, "using an": 9901, "an application": 521, "application first": 991, "first perspective": 3676, "perspective networking": 6939, "networking tcp": 6254, "tcp ip": 8991, "ip internet": 5040, "javascript": 5131, "interactive": 4938, "visualizations": 10052, "across": 276, "js": 5152, "dataviz": 2578, "d3": 2510, "matplotlib": 5714, "data visualization": 2554, "visualization with": 10051, "python and": 7492, "and javascript": 735, "javascript building": 5132, "building interactive": 1590, "interactive visualizations": 4945, "visualizations across": 10053, "across python": 278, "and js": 736, "js dataviz": 5154, "dataviz d3": 2579, "d3 js": 2511, "js matplotlib": 5155, "web": 10123, "apis": 975, "api": 973, "documentation": 2966, "security": 8140, "rest": 7807, "designing web": 2746, "web apis": 10125, "apis practical": 976, "practical patterns": 7129, "for api": 3715, "api design": 974, "design documentation": 2701, "documentation and": 2967, "and security": 854, "security api": 8142, "design rest": 2718, "rest web": 7813, "domain": 2978, "driven": 3007, "tackling": 8976, "heart": 4356, "strategic": 8742, "tactical": 8978, "modeling": 5989, "complex": 2054, "domains": 2985, "ddd": 2590, "bounded": 1529, "context": 2321, "domain driven": 2979, "driven design": 3013, "design tackling": 2724, "tackling complexity": 8977, "complexity in": 2063, "in the": 4731, "the heart": 9220, "heart of": 4358, "of software": 6523, "software strategic": 8491, "strategic and": 8743, "and tactical": 885, "tactical patterns": 8979, "for modeling": 3818, "modeling complex": 5993, "complex domains": 2057, "domains ddd": 2986, "ddd modeling": 2591, "modeling bounded": 5992, "bounded context": 1530, "improving": 4611, "existing": 3494, "guided": 4268, "smells": 8363, "refactoring improving": 7680, "improving the": 4615, "the design": 9180, "design of": 2711, "of existing": 6442, "existing code": 3495, "code guided": 1892, "guided approach": 4269, "approach to": 1046, "to refactoring": 9566, "refactoring with": 7682, "with examples": 10233, "examples in": 3483, "in java": 4681, "java refactoring": 5123, "refactoring design": 7679, "design smells": 2722, "kubernetes": 5242, "action": 282, "deploying": 2679, "apps": 1057, "containers": 2313, "orchestration": 6708, "kubernetes in": 5244, "in action": 4621, "action hands": 284, "on guide": 6588, "to deploying": 9502, "deploying and": 2680, "operating apps": 6672, "apps on": 1059, "on kubernetes": 6596, "kubernetes kubernetes": 5245, "kubernetes containers": 5243, "containers orchestration": 2314, "terraform": 9071, "up": 9846, "running": 7958, "infrastructure": 4817, "as": 1169, "iac": 4474, "cloud": 1850, "terraform up": 9075, "up running": 9849, "running practical": 7959, "practical infrastructure": 7124, "infrastructure as": 4818, "as code": 1172, "code with": 1901, "with terraform": 10282, "terraform terraform": 9074, "terraform iac": 9072, "iac cloud": 4475, "reactive": 7613, "responsive": 7803, "resilient": 7787, "akka": 445, "resilience": 7786, "reactive design": 7615, "patterns patterns": 6871, "for building": 3725, "building responsive": 1596, "responsive and": 7804, "and resilient": 842, "resilient reactive": 7788, "reactive systems": 7616, "systems reactive": 8952, "reactive akka": 7614, "akka resilience": 446, "continuous": 2324, "frequent": 3961, "releases": 7716, "cd": 1707, "pipelines": 6997, "deployment": 2682, "continuous delivery": 2325, "delivery principles": 2646, "reliable and": 7726, "and frequent": 696, "frequent software": 3962, "software releases": 8475, "releases cd": 7717, "cd pipelines": 1708, "pipelines deployment": 6999, "create": 2420, "world": 10347, "class": 1805, "agility": 414, "tech": 9006, "organizations": 6719, "culture": 2477, "the devops": 9181, "devops handbook": 2820, "handbook how": 4305, "how to": 4439, "to create": 9497, "create world": 2422, "world class": 10348, "class agility": 1806, "agility reliability": 416, "reliability and": 7719, "security in": 8150, "in tech": 4729, "tech organizations": 9007, "organizations devops": 6720, "devops culture": 2818, "culture delivery": 2478, "shipping": 8290, "learning engineering": 5349, "engineering practical": 3276, "building and": 1582, "and shipping": 862, "shipping ml": 8291, "ml systems": 5943, "systems ml": 8947, "ml engineering": 5940, "engineering pipelines": 3275, "mobile": 5952, "edge": 3071, "applied": 1016, "projects": 7431, "platforms": 7025, "practical deep": 7120, "learning for": 5351, "for cloud": 3729, "cloud mobile": 1856, "mobile edge": 5959, "edge applied": 3072, "applied deep": 1020, "learning projects": 5374, "projects across": 7432, "across platforms": 277, "platforms deep": 7027, "learning edge": 5348, "edge mobile": 3074, "mlops": 5947, "at": 1221, "scale": 8025, "mlops engineering": 5950, "engineering at": 3228, "at scale": 1226, "scale end": 8027, "end mlops": 3198, "mlops patterns": 5951, "for production": 3837, "production ml": 7329, "ml mlops": 5942, "mlops deployment": 5949, "deployment monitoring": 2684, "tinyml": 9471, "microcontrollers": 5858, "embedded": 3154, "iot": 5037, "tinyml building": 9472, "building machine": 1592, "learning models": 5366, "models for": 6019, "for microcontrollers": 3817, "microcontrollers tinyml": 5860, "tinyml embedded": 9473, "embedded iot": 3155, "apache": 967, "airflow": 441, "scheduling": 8042, "data pipelines": 2540, "pipelines with": 7002, "with apache": 10215, "apache airflow": 968, "airflow designing": 444, "designing and": 2733, "and building": 613, "building data": 1586, "pipelines using": 7001, "using airflow": 9899, "airflow airflow": 442, "airflow data": 443, "pipelines scheduling": 7000, "business": 1608, "speed": 8595, "thought": 9419, "business the": 1625, "the speed": 9326, "speed of": 8597, "of thought": 6536, "thought topics": 9422, "topics computer": 9623, "computer science": 2173, "science computer": 8059, "science topics": 8075, "tom": 9599, "clancy": 1803, "net": 6197, "force": 3887, "tom clancy": 9600, "clancy net": 1804, "net force": 6204, "force topics": 3892, "program": 7348, "to program": 9562, "program topics": 7359, "human": 4450, "use": 9874, "beings": 1434, "the human": 9225, "human use": 4462, "use of": 9877, "of human": 6456, "human beings": 4451, "beings topics": 1435, "beginning": 1411, "was": 10090, "command": 1986, "line": 5455, "the beginning": 9142, "beginning was": 1420, "was the": 10093, "the command": 9162, "command line": 1987, "line topics": 5459, "eye": 3574, "minds": 5904, "the eye": 9197, "eye of": 3575, "of minds": 6477, "minds topics": 5906, "only": 6639, "you": 10394, "can": 1648, "save": 8006, "mankind": 5619, "only you": 6640, "you can": 10395, "can save": 1650, "save mankind": 8007, "mankind topics": 5620, "oppression": 6683, "reinforce": 7702, "racism": 7559, "algorithms of": 480, "of oppression": 6496, "oppression how": 6684, "how search": 4435, "engines reinforce": 3313, "reinforce racism": 7703, "racism computer": 7560, "doing": 2973, "of doing": 6431, "doing science": 2977, "science and": 8056, "and engineering": 680, "engineering topics": 3300, "solutions": 8519, "java software": 5126, "software solutions": 8488, "solutions topics": 8527, "technology": 9038, "technology in": 9042, "action topics": 287, "innovations": 4830, "intelligence applications": 4895, "applications and": 1001, "and innovations": 725, "innovations topics": 4834, "new": 6282, "kind": 5203, "new kind": 6291, "kind of": 5204, "of science": 6518, "exit": 3498, "strategy": 8749, "exit strategy": 3499, "strategy topics": 8751, "distilled": 2927, "science distilled": 8060, "distilled topics": 2928, "collapse": 1936, "system collapse": 8892, "collapse topics": 1937, "quantum": 7538, "computation": 2099, "quantum computation": 7541, "computation and": 2100, "and quantum": 833, "quantum information": 7543, "information topics": 4809, "real": 7619, "life": 5437, "in real": 4711, "real life": 7620, "life topics": 5444, "concrete": 2250, "mathematics": 5700, "concrete mathematics": 2251, "mathematics topics": 5706, "freedom": 3959, "freedom topics": 3960, "systems topics": 8964, "hacking": 4287, "become": 1402, "expert": 3521, "next": 6302, "gen": 4070, "penetration": 6894, "testing": 9083, "purple": 7482, "teaming": 8999, "on hacking": 6589, "hacking become": 4289, "become an": 1403, "an expert": 528, "expert at": 3522, "at next": 1224, "next gen": 6303, "gen penetration": 4071, "penetration testing": 6896, "testing and": 9085, "and purple": 828, "purple teaming": 7483, "teaming computer": 9000, "version": 9986, "to java": 9529, "java programming": 5122, "programming comprehensive": 7383, "comprehensive version": 2091, "version computer": 9987, "systems analysis": 8922, "analysis and": 543, "and design": 658, "design topics": 2725, "pro": 7224, "git": 4137, "pro git": 7227, "git topics": 4139, "advances": 351, "computers": 2187, "advances in": 352, "in computers": 4643, "computers topics": 2197, "structures algorithms": 8766, "and software": 869, "software principles": 8467, "principles in": 7211, "in topics": 4732, "glut": 4162, "mastering": 5667, "through": 9431, "ages": 400, "glut mastering": 4163, "mastering information": 5671, "information through": 4808, "through the": 9439, "the ages": 9128, "ages computer": 401, "discrete": 2904, "discrete mathematics": 2908, "to data": 9498, "structures with": 8779, "with applications": 10216, "applications topics": 1012, "uncanny": 9774, "valley": 9960, "uncanny valley": 9775, "valley topics": 9961, "everybody": 3434, "lies": 5434, "big": 1462, "what": 10151, "tell": 9052, "us": 9865, "about": 240, "who": 10163, "we": 10107, "really": 7627, "are": 1141, "everybody lies": 3435, "lies big": 5435, "big data": 1463, "data new": 2539, "new data": 6286, "data and": 2524, "and what": 927, "what the": 10153, "the internet": 9234, "internet can": 4981, "can tell": 1651, "tell us": 9055, "us about": 9866, "about who": 247, "who we": 10166, "we really": 10109, "really are": 7628, "are computer": 1142, "the basics": 9140, "basics of": 1379, "of hacking": 6453, "hacking and": 4288, "and penetration": 807, "testing topics": 9092, "early": 3041, "objects": 6369, "java how": 5116, "program early": 7353, "early objects": 3042, "objects topics": 6371, "intelligence topics": 4909, "structures using": 8778, "using and": 9902, "and topics": 902, "choose": 1783, "choose you": 1784, "you topics": 10397, "physics": 6979, "students": 8787, "emphasis": 3174, "atomic": 1238, "semiconductor": 8188, "physics for": 6983, "for computer": 3735, "science students": 8073, "students with": 8790, "with emphasis": 10231, "emphasis on": 3175, "on atomic": 6568, "atomic and": 1239, "and semiconductor": 857, "semiconductor physics": 8189, "physics computer": 6982, "btec": 1560, "national": 6177, "it": 5077, "practitioners": 7159, "btec national": 1562, "national for": 6179, "for it": 3805, "it practitioners": 5084, "practitioners topics": 7161, "head": 4342, "head first": 4343, "first python": 3678, "python topics": 7509, "erebos": 3369, "erebos topics": 3370, "combinatorial": 1975, "discrete and": 2905, "and combinatorial": 628, "combinatorial mathematics": 1978, "cult": 2472, "dead": 2592, "cow": 2400, "cult of": 2473, "of the": 6532, "the dead": 9175, "dead cow": 2593, "cow topics": 2401, "algorithm": 454, "structures and": 8767, "and algorithm": 585, "algorithm analysis": 455, "analysis in": 548, "diggers": 2849, "diggers topics": 2850, "dataclysm": 2574, "dataclysm topics": 2575, "countdown": 2386, "zero": 10421, "day": 2583, "stuxnet": 8805, "launch": 5298, "digital": 2851, "weapon": 10111, "countdown to": 2387, "to zero": 9588, "zero day": 10422, "day stuxnet": 2584, "stuxnet and": 8806, "and the": 894, "the launch": 9242, "launch of": 5299, "the world": 9367, "world first": 10351, "first digital": 3671, "digital weapon": 2874, "weapon topics": 10112, "development principles": 2799, "principles patterns": 7213, "patterns and": 6866, "practices topics": 7158, "machines": 5549, "think": 9402, "machines that": 5553, "that think": 9115, "think topics": 9405, "halting": 4299, "state": 8670, "halting state": 4300, "state topics": 8673, "mathematical": 5692, "physicists": 6977, "mathematical methods": 5696, "for physicists": 3831, "physicists topics": 6978, "hacker": 4276, "crackdown": 2406, "law": 5300, "disorder": 2917, "electronic": 3116, "frontier": 3987, "the hacker": 9217, "hacker crackdown": 4278, "crackdown law": 2407, "law and": 5301, "and disorder": 667, "disorder on": 2918, "on the": 6618, "the electronic": 9188, "electronic frontier": 3122, "frontier computer": 3988, "advanced": 325, "computing": 2199, "advanced computing": 329, "computing and": 2200, "and systems": 884, "systems for": 8939, "for security": 3855, "security topics": 8159, "true": 9717, "names": 6168, "opening": 6661, "cyberspace": 2504, "true names": 9718, "names and": 6169, "the opening": 9278, "opening of": 6662, "the cyberspace": 9171, "cyberspace frontier": 2506, "to machine": 9537, "learning topics": 5388, "connectionist": 2285, "brain": 1536, "function": 3994, "connectionist modeling": 2286, "modeling and": 5990, "and brain": 611, "brain function": 1538, "function topics": 3996, "and algorithms": 587, "algorithms in": 477, "in python": 4709, "java concurrency": 5111, "concurrency in": 2254, "in practice": 4706, "practice topics": 7147, "edition topics": 3079, "refactoring topics": 7681, "four": 3933, "hidden": 4377, "dna": 2957, "amazon": 504, "apple": 979, "facebook": 3580, "the four": 9201, "four the": 3934, "the hidden": 9221, "hidden dna": 4379, "dna of": 2958, "of amazon": 6389, "amazon apple": 505, "apple facebook": 981, "facebook and": 3581, "and google": 704, "google computer": 4186, "dealers": 2594, "lightning": 5452, "xerox": 10379, "parc": 6833, "dawn": 2580, "age": 373, "dealers of": 2595, "of lightning": 6468, "lightning xerox": 5454, "xerox parc": 10380, "parc and": 6834, "the dawn": 9174, "dawn of": 2581, "the computer": 9165, "computer age": 2135, "age computer": 375, "beginning python": 1418, "turing": 9734, "omnibus": 6558, "the new": 9272, "new turing": 6299, "turing omnibus": 9736, "omnibus topics": 6559, "game": 4036, "game programming": 4041, "programming patterns": 7399, "patterns topics": 6872, "object": 6358, "oriented": 6724, "to object": 9555, "object oriented": 6361, "oriented programming": 6741, "programming topics": 7408, "win": 10182, "for the": 3877, "the win": 9361, "win topics": 10183, "perl": 6929, "programming perl": 7400, "perl topics": 6931, "cooperative": 2350, "cooperative design": 2351, "design visualization": 2727, "visualization and": 10044, "since": 8325, "democritus": 2653, "quantum computing": 7542, "computing since": 2222, "since democritus": 8326, "democritus topics": 2654, "lost": 5517, "math": 5686, "lost in": 5518, "in math": 4690, "math topics": 5688, "wings": 10195, "wings topics": 10196, "html": 4441, "pocket": 7050, "html pocket": 4442, "pocket reference": 7052, "reference computer": 7684, "shadows": 8274, "mind": 5896, "shadows of": 8275, "the mind": 9260, "mind topics": 5903, "malware": 5581, "practical malware": 7126, "malware analysis": 5582, "analysis topics": 554, "java java": 5118, "java topics": 5128, "reverse": 7840, "reverse design": 7841, "python machine": 7500, "alignment": 491, "problem": 7241, "the alignment": 9129, "alignment problem": 492, "problem topics": 7243, "bitcoin": 1487, "cryptocurrency": 2452, "technologies": 9031, "bitcoin and": 1488, "and cryptocurrency": 645, "cryptocurrency technologies": 2453, "technologies topics": 9037, "regular": 7699, "expressions": 3560, "mastering regular": 5678, "regular expressions": 7701, "expressions topics": 3561, "hundred": 4463, "page": 6796, "the hundred": 9226, "hundred page": 4464, "page machine": 6797, "learning book": 5340, "book topics": 1519, "stone": 8729, "the pattern": 9281, "pattern on": 6861, "the stone": 9330, "stone topics": 8730, "discovering": 2892, "2018": 140, "discovering computers": 2894, "computers 2018": 2188, "2018 topics": 141, "success": 8811, "technology for": 9041, "for success": 3871, "success topics": 8814, "steve": 8720, "jobs": 5139, "who was": 10165, "was steve": 10092, "steve jobs": 8721, "jobs topics": 5140, "electronics": 3132, "electron": 3114, "imaging": 4560, "in electronics": 4659, "electronics and": 3133, "and electron": 677, "electron physics": 3115, "physics advances": 6980, "in imaging": 4672, "imaging and": 4561, "physics topics": 6984, "ruthless": 7965, "com": 1956, "ruthless com": 7966, "com topics": 1970, "instructional": 4857, "instructional design": 4858, "program design": 7351, "learning perl": 5369, "graph": 4200, "mathematics with": 5707, "with graph": 10241, "graph theory": 4202, "theory topics": 9390, "structures topics": 8777, "swarm": 8854, "in swarm": 4725, "swarm intelligence": 8856, "cybersecurity": 2501, "essentials": 3395, "cybersecurity essentials": 2502, "essentials topics": 3398, "bromeliad": 1558, "the bromeliad": 9150, "bromeliad topics": 1559, "mathematics for": 5703, "for machine": 3813, "future": 4020, "scientific": 8082, "quest": 7548, "understand": 9788, "enhance": 3316, "empower": 3184, "the future": 9205, "future of": 4024, "mind the": 5902, "the scientific": 9312, "scientific quest": 8086, "quest to": 7550, "to understand": 9585, "understand enhance": 9789, "enhance and": 3317, "and empower": 679, "empower the": 3185, "mind computer": 5898, "user": 9882, "story": 8739, "mapping": 5642, "user story": 9893, "story mapping": 8740, "mapping topics": 5646, "ware": 10083, "tetralogy": 9098, "software ware": 8510, "ware tetralogy": 10084, "tetralogy topics": 9099, "synners": 8873, "synners topics": 8874, "krondor": 5240, "betrayal": 1443, "krondor the": 5241, "the betrayal": 9145, "betrayal computer": 1444, "using topics": 9938, "numerical": 6351, "engineers": 3306, "applied numerical": 1027, "numerical methods": 6353, "for engineers": 3767, "engineers and": 3307, "and scientists": 853, "scientists topics": 8094, "automating": 1281, "inequality": 4766, "automating inequality": 1282, "inequality topics": 4767, "tour": 9636, "jungle": 5164, "learn programming": 5323, "programming your": 7412, "your guided": 10403, "guided tour": 4271, "tour through": 9637, "the programming": 9294, "programming jungle": 7393, "jungle computer": 5165, "here": 4365, "comes": 1982, "here comes": 4366, "comes everybody": 1983, "everybody topics": 3436, "sams": 7986, "teach": 8992, "yourself": 10410, "10": 2, "minutes": 5926, "sams teach": 7987, "teach yourself": 8993, "yourself sql": 10413, "sql in": 8630, "in 10": 4617, "10 minutes": 3, "minutes topics": 5927, "organization": 6713, "computer organization": 2167, "organization and": 6714, "illuminated": 4545, "science illuminated": 8065, "illuminated topics": 4546, "crypto": 2449, "crypto topics": 2451, "kids": 5196, "playful": 7035, "python for": 7495, "for kids": 3807, "kids playful": 5197, "playful introduction": 7036, "to programming": 9563, "programming computer": 7384, "to computation": 9493, "and programming": 825, "programming using": 7409, "using python": 9929, "programming with": 7411, "with java": 10247, "oceanography": 6375, "essentials of": 3397, "of oceanography": 6494, "oceanography topics": 6376, "purely": 7480, "functional": 3997, "purely functional": 7481, "functional data": 3998, "transformers for": 9682, "for natural": 3822, "processing topics": 7305, "on intelligence": 6592, "wizardry": 10301, "digest": 2847, "third": 9412, "young": 10398, "wizards": 10303, "series": 8208, "high wizardry": 4387, "wizardry digest": 10302, "digest the": 2848, "the third": 9337, "third book": 9413, "book in": 1516, "the young": 9368, "young wizards": 10399, "wizards series": 10304, "series computer": 8210, "linux": 5473, "linux pocket": 5477, "pocket guide": 7051, "guide computer": 4258, "bioinformatics": 1466, "bioinformatics topics": 1472, "over": 6779, "power": 7089, "intuition": 5023, "expertise": 3528, "era": 3366, "mind over": 5901, "over machine": 6780, "machine the": 5543, "the power": 9287, "power of": 7097, "human intuition": 4458, "intuition and": 5024, "and expertise": 688, "expertise in": 3529, "the era": 9192, "era of": 3367, "computer computer": 2145, "dictionary": 2836, "new hacker": 6289, "hacker dictionary": 4279, "dictionary topics": 2838, "responsive web": 7806, "web design": 10128, "irresistible": 5050, "irresistible topics": 5051, "neural information": 6274, "information processing": 4796, "nutshell": 6355, "python in": 7499, "in nutshell": 4702, "nutshell topics": 6357, "programs": 7413, "structures programs": 8776, "programs topics": 7417, "iot topics": 5038, "apprendre": 1039, "apprendre topics": 1040, "perceptrons": 6905, "perceptrons topics": 6906, "running topics": 7960, "representing": 7752, "landscapes": 5264, "representing landscapes": 7753, "landscapes topics": 5265, "rule": 7941, "34": 178, "rule 34": 7942, "34 topics": 179, "mining": 5909, "data mining": 2536, "mining topics": 5920, "scene": 8036, "pattern classification": 6857, "classification and": 1818, "and scene": 850, "scene analysis": 8037, "secrets": 8131, "networked": 6241, "secrets and": 8132, "and lies": 743, "lies digital": 5436, "digital security": 2871, "in networked": 4700, "networked world": 6245, "world computer": 10349, "coders": 1902, "ai and": 420, "for coders": 3730, "coders topics": 1903, "cryptography": 2454, "network": 6223, "cryptography and": 2455, "and network": 789, "network security": 6236, "recognition topics": 7651, "sketching": 8340, "experiences": 3511, "sketching user": 8341, "user experiences": 9886, "experiences topics": 3512, "dream": 3001, "park": 6835, "dream park": 3002, "park topics": 6836, "uml": 9764, "uml distilled": 9766, "algorithmic": 461, "to computer": 9495, "science an": 8055, "an algorithmic": 520, "algorithmic approach": 463, "approach computer": 1043, "applying": 1035, "applying uml": 1037, "uml and": 9765, "and patterns": 805, "cyberpunk": 2499, "outlaws": 6768, "hackers": 4282, "cyberpunk outlaws": 2500, "outlaws and": 6769, "and hackers": 709, "hackers on": 4284, "computer frontier": 2154, "poetical": 7053, "works": 10334, "bret": 1545, "harte": 4335, "the poetical": 9286, "poetical works": 7054, "works of": 10336, "of bret": 6401, "bret harte": 1546, "harte topics": 4336, "ethical": 3408, "ethical hacking": 3411, "testing guide": 9089, "guide topics": 4265, "ibm": 4478, "spss": 8615, "discovering statistics": 2896, "statistics using": 8703, "using ibm": 9913, "ibm spss": 4483, "spss statistics": 8620, "statistics topics": 8702, "parallel": 6820, "parallel processing": 6825, "processing and": 7296, "and applied": 591, "applied mathematics": 1026, "image": 4549, "image analysis": 4550, "and recognition": 836, "making": 5577, "money": 6057, "online": 6634, "making money": 5580, "money online": 6058, "online topics": 6638, "administration": 316, "ip network": 5041, "network administration": 6224, "administration computer": 317, "primer": 7202, "plus": 7042, "primer plus": 7205, "plus topics": 7046, "rise": 7886, "rocket": 7916, "girls": 4132, "rise of": 7887, "the rocket": 9306, "rocket girls": 7917, "girls topics": 4133, "cybercrime": 2494, "forensics": 3893, "cybercrime and": 2495, "and digital": 663, "digital forensics": 2861, "forensics topics": 3899, "made": 5559, "easy": 3045, "algorithms made": 479, "made easy": 5560, "easy in": 3046, "intro": 5006, "stats": 8705, "intro stats": 5007, "stats topics": 8706, "space": 8554, "demons": 2658, "space demons": 8556, "demons topics": 2659, "comptia": 2092, "study": 8801, "comptia security": 2095, "security study": 8157, "study guide": 8802, "band": 1337, "untold": 9844, "women": 10309, "broad band": 1553, "band the": 1338, "the untold": 9346, "untold story": 9845, "story of": 8741, "the women": 9363, "women who": 10310, "who made": 10164, "made the": 5561, "internet computer": 4982, "this": 9415, "is": 5052, "they": 9393, "me": 5743, "ends": 3202, "this is": 9416, "is how": 5055, "how they": 4438, "they tell": 9394, "tell me": 9053, "me the": 5744, "world ends": 10350, "ends topics": 3203, "97": 229, "things": 9395, "every": 3432, "should": 8294, "know": 5217, "97 things": 231, "things every": 9397, "every programmer": 3433, "programmer should": 7367, "should know": 8295, "know topics": 5219, "poison": 7059, "island": 5061, "poison island": 7060, "island topics": 5062, "atlas": 1232, "atlas of": 1233, "ai topics": 428, "and data": 650, "doing data": 2975, "emerging": 3165, "communication": 2002, "emerging research": 3169, "research in": 7775, "in computing": 4644, "computing information": 2215, "information communication": 4789, "communication and": 2003, "and applications": 590, "computer studies": 2180, "studies topics": 8795, "computer architecture": 2142, "architecture topics": 1116, "late": 5296, "program late": 7355, "late objects": 5297, "objects version": 6372, "version topics": 9988, "encyclopedia": 3192, "encyclopedia of": 3194, "and technology": 888, "technology topics": 9044, "effective topics": 3098, "classical": 1812, "classical and": 1813, "and object": 794, "oriented software": 6743, "software engineering": 8439, "explained": 3530, "spss explained": 8618, "explained topics": 3532, "systems programming": 8951, "manga": 5617, "databases": 2569, "the manga": 9252, "manga guide": 5618, "to databases": 9499, "databases topics": 2572, "growing": 4250, "by": 1629, "tests": 9095, "growing object": 4252, "software guided": 8446, "guided by": 4270, "by tests": 1638, "tests topics": 9097, "exam": 3472, "fc0": 3616, "u51": 9750, "1st": 56, "comptia it": 2093, "it fundamentals": 5080, "fundamentals study": 4013, "guide exam": 4259, "exam fc0": 3476, "fc0 u51": 3617, "u51 1st": 9751, "1st edition": 57, "edition computer": 3076, "night": 6306, "moves": 6086, "no": 6311, "night moves": 6307, "moves tom": 6087, "force no": 3890, "no topics": 6312, "ui": 9759, "practical ui": 7135, "ui topics": 9760, "visual": 10033, "in visual": 4736, "visual computing": 10035, "computing topics": 2227, "army": 1149, "none": 6320, "army of": 1150, "of none": 6492, "none topics": 6321, "let": 5411, "let us": 5412, "us python": 9867, "black": 1493, "black book": 1494, "book comprehensive": 1513, "comprehensive guide": 2088, "mastery computer": 5680, "balanced": 1333, "balanced introduction": 1334, "survival": 8846, "manual": 5621, "spss survival": 8621, "survival manual": 8849, "manual topics": 5624, "hadoop": 4295, "quick": 7551, "start": 8663, "ecosystem": 3062, "hadoop quick": 4297, "quick start": 7552, "start guide": 8665, "guide learn": 4261, "learn the": 5324, "the essentials": 9195, "of big": 6400, "data computing": 2529, "computing in": 2214, "the apache": 9134, "apache hadoop": 969, "hadoop ecosystem": 4296, "ecosystem computer": 3063, "understanding": 9790, "literacies": 5482, "understanding digital": 9797, "digital literacies": 2865, "literacies topics": 5483, "uml topics": 9771, "cosmonaut": 2375, "keep": 5181, "cosmonaut keep": 2376, "keep topics": 5182, "fastcard": 3607, "fastcard topics": 3608, "star": 8660, "fraction": 3941, "star fraction": 8661, "fraction topics": 3942, "export": 3552, "controls": 2339, "export controls": 3553, "controls topics": 2340, "serious": 8214, "serious cryptography": 8215, "cryptography topics": 2458, "knowledge": 5220, "management": 5587, "intelligence for": 4898, "for knowledge": 3808, "knowledge management": 5228, "management topics": 5600, "and program": 824, "design in": 2707, "blockchain": 1499, "blockchain topics": 1503, "pinterest": 6991, "dummies": 3024, "pinterest for": 6992, "for dummies": 3755, "dummies topics": 3025, "assessment": 1195, "security assessment": 8143, "assessment topics": 1199, "computational": 2106, "fluid": 3694, "dynamics": 3034, "computational fluid": 2115, "fluid dynamics": 3696, "dynamics topics": 3036, "digital design": 2855, "design and": 2693, "and computer": 634, "perspectives": 6942, "new perspectives": 6294, "perspectives on": 6946, "on computer": 6575, "computer concepts": 2146, "concepts topics": 2243, "one": 6627, "device": 2810, "secret": 8129, "history": 4403, "iphone": 5043, "the one": 9276, "one device": 6628, "device the": 2811, "the secret": 9314, "secret history": 8130, "history of": 4404, "the iphone": 9236, "iphone computer": 5044, "java cookbook": 5112, "cookbook topics": 2347, "discrete mathematical": 2907, "mathematical structures": 5699, "genealogy": 4074, "genealogy online": 4075, "play": 7029, "mind at": 5897, "at play": 1225, "play topics": 7032, "cryptography engineering": 2456, "engineering design": 3234, "design principles": 2714, "and practical": 813, "practical applications": 7116, "applications computer": 1002, "computers fundamentals": 2191, "fundamentals computer": 4011, "horizons": 4422, "horizons in": 4423, "in computer": 4642, "science research": 8072, "research topics": 7782, "sas": 7997, "platform": 7020, "sas intelligence": 8000, "intelligence platform": 4902, "platform topics": 7024, "to design": 9504, "design programs": 2716, "programs an": 7415, "programming and": 7377, "and computing": 636, "computing computer": 2203, "and information": 723, "information systems": 4804, "business intelligence": 1613, "intelligence practices": 4903, "practices technologies": 7156, "technologies and": 9032, "and management": 752, "management computer": 5590, "pgp": 6962, "source": 8539, "internals": 4967, "pgp source": 6963, "source code": 8540, "code and": 1887, "and internals": 730, "internals topics": 4968, "office": 6545, "your office": 10405, "office topics": 6547, "crafting": 2408, "interpreters": 4994, "crafting interpreters": 2409, "interpreters topics": 4995, "inside": 4839, "inside com": 4841, "computer networks": 2165, "networks topics": 6269, "compiler": 2036, "implementation": 4583, "advanced compiler": 327, "compiler design": 2038, "and implementation": 718, "implementation topics": 4588, "system software": 8910, "software topics": 8505, "to expert": 9514, "expert systems": 3527, "social": 8384, "media": 5766, "social media": 8390, "media communication": 5768, "communication topics": 2012, "cooking": 2348, "geeks": 4068, "cooking for": 2349, "for geeks": 3783, "geeks topics": 4069, "scripts": 8107, "abaqus": 236, "python scripts": 7508, "scripts for": 8108, "for abaqus": 3704, "abaqus topics": 237, "creativity": 2430, "innovation": 4825, "the creativity": 9170, "creativity code": 2431, "code art": 1888, "art and": 1152, "and innovation": 724, "innovation in": 4828, "the age": 9127, "age of": 376, "ai computer": 421, "understanding computers": 9793, "to modern": 9550, "modern cryptography": 6029, "usborne": 9871, "complete": 2043, "astronomy": 1215, "books": 1520, "the usborne": 9349, "usborne complete": 9872, "complete book": 2045, "book of": 1517, "of astronomy": 6397, "astronomy and": 1216, "and space": 871, "space complete": 8555, "complete books": 2046, "books series": 1522, "series topics": 8212, "to graph": 9518, "algorithm design": 456, "construction": 2301, "jumpstart": 5158, "construction management": 2304, "management jumpstart": 5595, "jumpstart topics": 5160, "cloud computing": 1852, "george": 4116, "unbreakable": 9772, "george and": 4117, "the unbreakable": 9342, "unbreakable code": 9773, "code topics": 1900, "issues": 5075, "ethical and": 3409, "and social": 867, "social issues": 8387, "issues in": 5076, "the information": 9232, "information age": 4786, "age topics": 378, "society": 8396, "information society": 4801, "society topics": 8398, "rhesus": 7870, "chart": 1761, "the rhesus": 9304, "rhesus chart": 7871, "chart topics": 1762, "diagnose": 2824, "fix": 3683, "everything": 3441, "to diagnose": 9505, "diagnose and": 2825, "and fix": 693, "fix everything": 3684, "everything electronic": 3443, "electronic topics": 3130, "ruby": 7935, "the ruby": 9308, "ruby programming": 7938, "programming language": 7394, "language topics": 5278, "think stats": 9404, "analyzing": 570, "toolkit": 9608, "python analyzing": 7491, "analyzing text": 573, "text with": 9105, "with the": 10283, "the natural": 9268, "language toolkit": 5277, "toolkit computer": 9609, "101": 7, "101 design": 8, "design methods": 2709, "methods topics": 5837, "of computing": 6415, "life in": 5439, "in code": 4637, "css": 2461, "css cookbook": 2462, "telecommunications": 9048, "business and": 1609, "and telecommunications": 889, "telecommunications topics": 9049, "alone": 498, "together": 9591, "why": 10167, "expect": 3504, "more": 6071, "from": 3963, "less": 5409, "each": 3039, "other": 6754, "alone together": 499, "together why": 9592, "why we": 10169, "we expect": 10108, "expect more": 3505, "more from": 6073, "from technology": 3983, "technology and": 9039, "and less": 741, "less from": 5410, "from each": 3969, "each other": 3040, "other computer": 6755, "in computational": 4641, "computational intelligence": 2117, "scientist": 8089, "rarely": 7588, "talks": 8982, "things computer": 9396, "computer scientist": 2174, "scientist rarely": 8090, "rarely talks": 7589, "talks about": 8983, "about topics": 246, "php": 6969, "programming php": 7401, "php topics": 6972, "computability": 2096, "logic": 5506, "computability and": 2097, "and logic": 745, "logic topics": 5510, "analytics": 563, "and big": 608, "data analytics": 2523, "analytics topics": 567, "chaos": 1754, "fractals": 3939, "chaos and": 1755, "and fractals": 695, "fractals topics": 3940, "thoughts": 9423, "the rule": 9309, "rule of": 7946, "of thoughts": 6537, "thoughts topics": 9424, "import": 4603, "tidy": 9445, "transform": 9673, "visualize": 10054, "model": 5974, "science import": 8066, "import tidy": 4604, "tidy transform": 9446, "transform visualize": 9674, "visualize and": 10055, "and model": 774, "model data": 5979, "data computer": 2528, "today": 9589, "tomorrow": 9603, "computers today": 2196, "today and": 9590, "and tomorrow": 900, "tomorrow topics": 9604, "genomics": 4111, "bioinformatics and": 1468, "and functional": 697, "functional genomics": 3999, "genomics topics": 4113, "techgnosis": 9008, "techgnosis topics": 9009, "definitive": 2637, "hadoop the": 4298, "the definitive": 9178, "definitive guide": 2638, "delusion": 2649, "the net": 9271, "net delusion": 6201, "delusion topics": 2650, "foundations": 3928, "foundations and": 3929, "practice of": 7142, "of security": 6520, "mysql": 6158, "performance mysql": 6919, "mysql topics": 6160, "foundations of": 3930, "of python": 6507, "python network": 7501, "network programming": 6234, "collective": 1944, "smart": 8350, "programming collective": 7382, "collective intelligence": 1945, "intelligence building": 4896, "building smart": 1598, "smart web": 8358, "web applications": 10126, "android": 931, "learn java": 5321, "java for": 5115, "for android": 3714, "android development": 932, "development topics": 2805, "computer theory": 2182, "games": 4044, "for games": 3782, "games topics": 4048, "concepts basics": 2237, "basics topics": 1380, "science for": 8063, "system dynamics": 8896, "spss for": 8619, "for introductory": 3804, "introductory statistics": 5018, "beauty": 1398, "nature": 6186, "the computational": 9164, "computational beauty": 2110, "beauty of": 1399, "of nature": 6488, "nature topics": 6189, "starting": 8668, "out": 6765, "starting out": 8669, "out with": 6767, "combinatorics": 1980, "introductory combinatorics": 5015, "combinatorics topics": 1981, "gregg": 4227, "college": 1946, "keyboarding": 5192, "document": 2963, "gregg college": 4228, "college keyboarding": 1947, "keyboarding and": 5193, "and document": 672, "document processing": 2965, "speech": 8590, "speech and": 8591, "and language": 738, "advanced data": 331, "dictionary of": 2837, "course": 2392, "fuzzy": 4026, "first course": 3670, "course in": 2393, "in fuzzy": 4664, "fuzzy logic": 4027, "understanding operating": 9800, "fastai": 3605, "pytorch": 7512, "coders with": 1904, "with fastai": 10235, "fastai and": 3606, "and pytorch": 830, "pytorch topics": 7513, "laws": 5305, "and other": 802, "other laws": 6756, "laws of": 5306, "of cyberspace": 6422, "cyberspace computer": 2505, "hoaxer": 4406, "whistleblower": 10159, "spy": 8623, "many": 5634, "faces": 3582, "anonymous": 953, "hacker hoaxer": 4280, "hoaxer whistleblower": 4407, "whistleblower spy": 10160, "spy the": 8624, "the many": 9253, "many faces": 5636, "faces of": 3583, "of anonymous": 6392, "anonymous computer": 954, "discovery": 2897, "knowledge discovery": 5225, "discovery knowledge": 2901, "knowledge engineering": 5226, "engineering and": 3226, "and knowledge": 737, "perfect": 6909, "the perfect": 9283, "perfect weapon": 6910, "investigations": 5029, "computer forensics": 2153, "forensics and": 3894, "and investigations": 731, "investigations topics": 5030, "swift": 8857, "swift programming": 8858, "need": 6190, "internet book": 4980, "book everything": 1514, "everything you": 3446, "you need": 10396, "need to": 6192, "to know": 9531, "know about": 5218, "about computer": 242, "networking and": 6248, "and how": 712, "how the": 4437, "internet works": 4990, "works computer": 10335, "papers": 6801, "presented": 7193, "20th": 150, "annual": 948, 